/*Да се напише програма која од командна линија добива имиња на една влезна и една
излезна датотека. Програмата треба да ја измине влезната датотека и за секој ред да го најде
бројот на големи букви и бројот на самогласки. Притоа, во излезната датотека да ги
отпечати оние редови во кои има повеќе големи букви од самогласки. На крај во излезната
датотека да се испечатат бројот на големи букви и бројот на самогласки кои се појавиле во
целата датотека. Исто така, да се провери дали правилно се користи програмата, ако не, да
се даде упатство за користење. Линиите во датотеките имаат најмногу 250 знаци.*/

#include <stdio.h>
#include <string.h>
#include <ctype.h>

int main(int argc, char *argv[])
{

    FILE *fin, *fout;
    int niza[251];

    return 0;
}